app/controllers/properties_controller.rb

SELECT `properties`.* FROM `properties`
---
  def index
    @properties = Property.all

INSERT INTO `properties` (`user_id`, `postcode`, `prefecture_code`, `address_city`, `address_street`, `address_building`, `title`, `description`, `details`, `price`, `hobby`, `layout`, `location`, `created_at`, `updated_at`, `image`) VALUES (1, 5720086, 27, '寝屋川市', '松屋町', 'ああ', 'ddd', 'っっs', 'あああ', 100, 'aaa', 'あああ', 'aaa', '2020-10-31 04:30:15.829180', '2020-10-31 04:30:15.829180', 'bg1.jpg')
---
  def create
    @property = Property.new(property_params)

    #追加
    @property.user_id = current_user.id

    respond_to do |format|
      if @property.save

SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 3 LIMIT 1
---
    def set_property
      @property = Property.find(params[:id])